Repository: wangjianqi/AgentHub
Catalog: Sources/AgentHub/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# agents.empty.message
source: Currently scans Claude Code ~/.claude/agents and project .claude/agents, plus configured platform agent directories.
zh_hans: 当前主要扫描 Claude Code 的 ~/.claude/agents 和项目 .claude/agents，以及已配置平台的 agents 目录。

# agents.empty.title
source: No Agents Found
zh_hans: 没有发现 Agents

# agents.section.subtitle
source: %d total.
zh_hans: 共 %d 个。

# backups.backupFile
source: Backup: %@
zh_hans: 备份：%@

# backups.empty.message
source: Disabling/enabling MCP or migrating MCP will automatically create backups.
zh_hans: 停用/启用 MCP 或迁移 MCP 后会自动生成备份。

# backups.empty.title
source: No Backups Yet
zh_hans: 暂无备份

# backups.originalFile
source: Original: %@
zh_hans: 原文件：%@

# backups.select.message
source: Select a backup on the left to show the diff between the backup and the current file.
zh_hans: 左侧选择备份后，这里会显示备份文件和当前文件的差异。

# backups.select.title
source: Select a Backup
zh_hans: 选择一个备份

# backups.subtitle
source: Created automatically before config changes.
zh_hans: 配置修改前自动创建。

# backups.title
source: Backups
zh_hans: 备份

# button.backup
source: Back Up
zh_hans: 备份

# button.check
source: Check
zh_hans: 检查

# button.checkAll
source: Check All
zh_hans: 检查全部

# button.chooseProject
source: Choose Project
zh_hans: 选择项目

# button.clearProject
source: Clear Project
zh_hans: 清除项目

# button.copyCommand
source: Copy Command
zh_hans: 复制命令

# button.copyMigrationSnippet
source: Copy Migration Snippet
zh_hans: 复制迁移片段

# button.copySnippet
source: Copy Snippet
zh_hans: 复制片段

# button.delete
source: Delete
zh_hans: 删除

# button.disable
source: Disable
zh_hans: 停用

# button.enable
source: Enable
zh_hans: 启用

# button.open
source: Open
zh_hans: 打开

# button.refresh
source: Refresh
zh_hans: 刷新

# button.remove
source: Remove
zh_hans: 移除

# button.writeConfig
source: Write Config
zh_hans: 写入配置

# common.ok
source: OK
zh_hans: 确定

# configs.exists
source: Exists
zh_hans: 存在

# configs.missing
source: Missing
zh_hans: 未发现

# configs.subtitle
source: %d candidate paths, including existing and missing configs.
zh_hans: 共 %d 个候选路径，包含已存在和未发现的配置。

# configs.title
source: Config Files
zh_hans: 配置文件

# dashboard.configScan
source: Config File Scan
zh_hans: 配置文件扫描

# dashboard.installations
source: Tool Installation Status
zh_hans: 工具安装状态

# dashboard.mainRisks
source: Main Risks
zh_hans: 主要风险

# dashboard.noRisks
source: No obvious risk items found. Note: this is a static keyword scan, not a security audit.
zh_hans: 未发现明显风险项。注意：这不是安全审计，只是静态关键词扫描。

# dashboard.notFoundInPath
source: %@ not found in PATH
zh_hans: 未在 PATH 中发现 %@

# dashboard.stat.agents
source: Scans agents directories
zh_hans: 扫描 agents 目录

# dashboard.stat.backups
source: Auto-backup before writes
zh_hans: 写入前自动备份

# dashboard.stat.mcp
source: Parsed from JSON/TOML config
zh_hans: 从 JSON/TOML 配置中解析

# dashboard.stat.plugins
source: Scans plugin config and plugin directories
zh_hans: 扫描 plugin 配置和插件目录

# dashboard.stat.profiles
source: Scenario-based MCP groups
zh_hans: 场景化 MCP 分组

# dashboard.stat.risks
source: Keyword-based command/config analysis
zh_hans: 基于命令和配置关键词分析

# dashboard.stat.skills
source: Scans SKILL.md files
zh_hans: 扫描 SKILL.md 文件

# dashboard.subtitle
source: Version 2 supports MCP enable/disable, config backup, Diff, static availability checks, migration, and Profile grouping. Every write operation creates a backup first.
zh_hans: 第二版已支持启用/停用 MCP、配置备份、Diff、静态可用性检查、迁移和 Profile 分组。所有写入操作都会先备份。

# dashboard.title
source: Dashboard
zh_hans: 总览

# edit.disabledMCP
source: MCP Disabled
zh_hans: 已停用 MCP

# edit.enabledMCP
source: MCP Enabled
zh_hans: 已启用 MCP

# edit.mcpMigrated
source: MCP Migrated
zh_hans: 已迁移 MCP

# edit.mcpMigratedMessage
source: %@ has been written to %@ user-level config. Environment variables keep only key names; fill in real values manually.
zh_hans: 已将 %@ 写入 %@ 的用户级配置。环境变量仅保留 key 名称，真实值需要你手动补齐。

# edit.mcpWritten
source: %@ has been written to %@. A backup was created before the change.
zh_hans: %@ 已写入 %@。修改前已备份。

# error.fileNotFound
source: Config file not found: %@
zh_hans: 未找到配置文件：%@

# error.mcpNotFound
source: MCP not found in config file: %@
zh_hans: 没有在配置文件中找到 MCP：%@

# error.unsupportedTarget
source: Writing to target platform is not supported yet: %@
zh_hans: 暂不支持写入目标平台：%@

# health.commandExists.detail
source: Executable found: %@. This is a safe static availability check, not a full MCP JSON-RPC handshake.
zh_hans: 已找到可执行文件：%@。当前检查是安全的静态可用性检查，不等同于完整 MCP JSON-RPC 握手。

# health.commandExists.title
source: Command exists
zh_hans: 命令存在

# health.commandUnavailable.detail
source: Not found in PATH or absolute path: %@
zh_hans: 没有在 PATH 或绝对路径中找到：%@

# health.commandUnavailable.title
source: Command unavailable
zh_hans: 命令不可用

# health.missingCommand.detail
source: No command was parsed from the config, so MCP startup cannot be evaluated.
zh_hans: 配置中没有解析到 command，无法判断 MCP 是否可启动。

# health.missingCommand.title
source: Missing command
zh_hans: 缺少 command

# health.remoteMCP.detail
source: Remote URL detected. This version does not make network requests; it only confirms this is a remote endpoint: %@
zh_hans: 检测到远程 URL。当前版本不主动发起网络请求，只确认这是一个远程端点：%@

# health.remoteMCP.title
source: Remote MCP URL
zh_hans: 远程 MCP 地址

# health.riskyArgs.detail
source: Arguments include shell / sudo / rm -rf / curl-like fragments. Executable exists: %@. Review arguments manually before running.
zh_hans: 命令存在 shell / sudo / rm -rf / curl 等片段。已确认可执行文件存在：%@，但建议人工检查参数后再运行。

# health.riskyArgs.title
source: Risky command fragment
zh_hans: 命令存在风险片段

# health.runnerAvailable.detail
source: Found %@: %@. This type of MCP may fetch or load packages at runtime. This version does not auto-start third-party packages.
zh_hans: 已找到 %@：%@。这类 MCP 需要运行时拉取或加载包，当前版本不自动启动第三方包。

# health.runnerAvailable.title
source: Dependency runner available
zh_hans: 依赖运行器可用

# hooks.empty.message
source: Attempts to parse hooks fields from Claude/OpenClaw JSON config and Codex TOML config.
zh_hans: 会从 Claude/OpenClaw 的 JSON 配置和 Codex TOML 配置中尝试解析 hooks 字段。

# hooks.empty.title
source: No Hooks Found
zh_hans: 没有发现 Hooks

# hooks.noCommand
source: No concrete command parsed
zh_hans: 未解析到具体 command

# hooks.rawSnippet
source: Raw Snippet
zh_hans: 原始片段

# hooks.section.subtitle
source: %d total. Hooks may execute commands automatically, so review them carefully.
zh_hans: 共 %d 个。Hook 可能自动执行命令，建议重点审查。

# install.installed
source: Installed
zh_hans: 已安装

# install.missing
source: Missing
zh_hans: 未发现

# install.unknown
source: Unknown
zh_hans: 未知

# mcp.check.failed
source: Unavailable
zh_hans: 不可用

# mcp.check.ok
source: Available
zh_hans: 可用

# mcp.check.skipped
source: Not Checked
zh_hans: 未检查

# mcp.check.warning
source: Needs Review
zh_hans: 需确认

# mcp.disabled
source: Disabled
zh_hans: 停用

# mcp.empty.message
source: Click Choose Project to scan project-level .mcp.json, opencode.json, or .codex/config.toml.
zh_hans: 可以点击“选择项目”扫描项目级 .mcp.json、opencode.json 或 .codex/config.toml。

# mcp.empty.title
source: No MCP Servers Found
zh_hans: 没有发现 MCP Server

# mcp.enabled
source: Enabled
zh_hans: 启用

# mcp.noCommand
source: No command/args parsed
zh_hans: 未解析到 command/args

# mcp.noRawSnippet
source: No raw snippet
zh_hans: 无原始片段

# mcp.rawConfigSnippet
source: Raw Config Snippet
zh_hans: 原始配置片段

# mcp.section.subtitle
source: %d total. Supports enable/disable, static availability checks, migration, and Profile grouping.
zh_hans: 共 %d 个。支持启用/停用、静态可用性检查、迁移和 Profile 分组。

# menu.language
source: Language
zh_hans: 语言

# menu.refreshScan
source: Refresh Scan
zh_hans: 刷新扫描

# message.backupCreated
source: Backed up: %@ Backup location: %@
zh_hans: 已备份： %@ 备份位置： %@

# message.backupFailed
source: Backup failed: %@
zh_hans: 备份失败：%@

# message.backupPathSuffix
source: Backup location: %@
zh_hans: 备份位置： %@

# message.checkAllDone
source: Completed static availability checks for %d MCP servers.
zh_hans: 已完成 %d 个 MCP 的静态可用性检查。

# message.migrationFailed
source: Migration failed: %@
zh_hans: 迁移失败：%@

# message.migrationSnippetCopied
source: Migration snippet copied. Target platform: %@.
zh_hans: 已复制迁移片段。目标平台：%@。

# message.operationFailed
source: Operation failed: %@
zh_hans: 操作失败：%@

# message.profileAlreadyContainsMCP
source: This MCP is already in the Profile.
zh_hans: 该 MCP 已经在 Profile 中。

# message.profileCreated
source: Profile created: %@
zh_hans: 已创建 Profile：%@

# message.profileExported
source: Profile list copied: %@
zh_hans: 已复制 Profile 清单：%@

# message.profileMCPAdded
source: Added %@ to Profile: %@
zh_hans: 已将 %@ 加入 Profile：%@

# message.profileNameEmpty
source: Profile name cannot be empty.
zh_hans: Profile 名称不能为空。

# migration.empty.message
source: First confirm that MCP Servers have been scanned on the MCP page.
zh_hans: 先在 MCP 页面确认已扫描到 MCP Server。

# migration.empty.title
source: No MCP Available for Migration
zh_hans: 没有可迁移的 MCP

# migration.noCommand
source: No command parsed
zh_hans: 未解析到命令

# migration.preview
source: Migration Snippet Preview
zh_hans: 迁移片段预览

# migration.source
source: Source: %@ · %@
zh_hans: 来源：%@ · %@

# migration.subtitle
source: Migrate an MCP server to Claude Code, Codex, OpenClaw, or OpenCode. The target config is backed up before writing.
zh_hans: 把一个 MCP 从当前平台迁移到 Claude Code、Codex、OpenClaw 或 OpenCode。写入配置前会自动备份目标配置文件。

# migration.targetPlatform
source: Target Platform
zh_hans: 目标平台

# migration.title
source: MCP Migration
zh_hans: MCP 迁移

# migration.writeDirectly
source: Write directly to target user-level config
zh_hans: 直接写入目标平台用户级配置

# panel.chooseWorkspace
source: Choose a Project Directory to Scan
zh_hans: 选择要扫描的项目目录

# plugins.empty.message
source: Scans plugin/plugins fields in config files and OpenCode plugin directories.
zh_hans: 会扫描配置文件中的 plugin/plugins 字段，以及 OpenCode 的 ~/.config/opencode/plugins 和项目 .opencode/plugins 目录。

# plugins.empty.title
source: No Plugins Found
zh_hans: 没有发现 Plugins

# plugins.section.subtitle
source: %d total. This version only performs static scanning and does not execute plugins.
zh_hans: 共 %d 个。当前版本仅静态扫描，不执行插件。

# profiles.addMCP
source: Add MCP
zh_hans: 加入 MCP

# profiles.addToCurrent
source: Add to Current Profile
zh_hans: 加入当前 Profile

# profiles.create
source: New Profile
zh_hans: 新建 Profile

# profiles.empty.message
source: Create a Profile, then add frequently used MCP servers for scenario-based grouping.
zh_hans: 创建一个 Profile 后，可以把常用 MCP 加进去做场景化分组。

# profiles.empty.title
source: No Profiles Yet
zh_hans: 还没有 Profile

# profiles.export
source: Export List
zh_hans: 导出清单

# profiles.innerMCP
source: MCP in Profile
zh_hans: Profile 内 MCP

# profiles.innerMCP.subtitle
source: %d total.
zh_hans: 共 %d 个。

# profiles.namePlaceholder
source: Profile Name
zh_hans: Profile 名称

# profiles.noMCP
source: No MCP added yet.
zh_hans: 还没有加入 MCP。

# profiles.noNotes
source: No notes
zh_hans: 无备注

# profiles.noRecordedCommand
source: No recorded command
zh_hans: 未记录命令

# profiles.notesPlaceholder
source: Notes, optional
zh_hans: 备注，可选

# profiles.savePath
source: Saved at: %@
zh_hans: 保存位置：%@

# profiles.serverCount
source: %d MCP
zh_hans: %d 个 MCP

# profiles.subtitle
source: Save MCP combinations by scenario, such as iOS development, web development, and App Store release. This version manages grouping only and does not batch-edit configs automatically.
zh_hans: 按场景保存 MCP 组合，例如 iOS 开发、Web 开发、App Store 上架。当前版本做分组清单，不自动批量改配置。

# risk.agentRiskyKeywords.message
source: The Agent document contains shell execution, permission, deletion, or network-download related keywords. Open the file and review manually.
zh_hans: Agent 文档中出现 shell 执行、权限、删除或网络下载相关关键词。建议打开文件人工审查。

# risk.agentRiskyKeywords.title
source: Agent document contains high-risk instruction keywords
zh_hans: Agent 文档含高风险指令关键词

# risk.duplicateMCP.message
source: The same MCP server name appears in multiple config sources: %@. Confirm whether this is intentional to avoid different tools loading different parameters.
zh_hans: 同名 MCP server 出现在多个配置来源：%@。建议确认是否为有意复用，避免不同工具读取到不同参数。

# risk.duplicateMCP.title
source: Duplicate MCP name found
zh_hans: 发现重复 MCP 名称

# risk.hookPipeScript.message
source: Hooks execute automatically on events and are higher risk than ordinary config. Review manually and pin script sources.
zh_hans: Hook 会在特定事件中自动执行，风险高于普通配置。建议人工审查并固定脚本来源。

# risk.hookPipeScript.title
source: Hook contains piped shell execution
zh_hans: Hook 含管道执行脚本

# risk.hookRiskyCommand.message
source: The hook appears to include destructive or privileged commands. Disable it first and confirm the purpose.
zh_hans: Hook 中存在疑似破坏性或高权限命令。建议先禁用并确认用途。

# risk.hookRiskyCommand.title
source: Hook contains high-risk command
zh_hans: Hook 含高风险命令

# risk.mcpPipeScript.message
source: This MCP config appears to download via curl and pipe directly to shell. Prefer pinned versions, trusted sources, and manual script review.
zh_hans: 该 MCP 配置中疑似存在 curl 下载后直接交给 shell 执行的命令。建议改为固定版本、固定来源并人工审查脚本。

# risk.mcpPipeScript.title
source: MCP contains piped shell execution
zh_hans: MCP 含管道执行脚本

# risk.mcpPrivileged.message
source: This MCP config appears to contain sudo, rm -rf, or chmod 777. Confirm whether it is necessary.
zh_hans: 该 MCP 配置中疑似包含 sudo、rm -rf 或 chmod 777。建议确认是否必要。

# risk.mcpPrivileged.title
source: MCP contains privileged/destructive command
zh_hans: MCP 含高权限/破坏性命令

# risk.mcpRemoteRunner.message
source: This MCP starts via npx/uvx/bunx/pipx. Pin package versions to avoid unexpected upstream behavior changes.
zh_hans: 该 MCP 通过 npx/uvx/bunx/pipx 等方式启动。建议固定包版本，避免上游更新导致行为变化。

# risk.mcpRemoteRunner.title
source: MCP uses remote package runner
zh_hans: MCP 使用远程包执行器

# risk.mcpSensitiveEnv.message
source: Sensitive environment variable keys detected: %@. The UI only shows key names; verify values are not committed in plaintext project config.
zh_hans: 检测到敏感环境变量键：%@。UI 已只显示键名，建议确认值没有明文提交到项目配置。

# risk.mcpSensitiveEnv.title
source: MCP config contains sensitive environment variables
zh_hans: MCP 配置包含敏感环境变量

# risk.missingExecutable.message
source: %@ was not found in PATH. If installed but not shown, the GUI app PATH may differ from your terminal PATH.
zh_hans: 没有在 PATH 中发现 %@。如果你已安装但未显示，可能是 GUI App 的 PATH 与终端不同。

# risk.missingExecutable.title
source: Executable not found
zh_hans: 未发现可执行文件

# risk.pluginRemote.message
source: Plugin config or content contains remote URL, npm/npx, or similar keywords. Confirm source trust and pin versions.
zh_hans: 插件配置或文件内容中出现远程地址、npm/npx 等关键词。建议确认来源可信并固定版本。

# risk.pluginRemote.title
source: Plugin may come from a remote source
zh_hans: 插件可能来自远程来源

# risk.pluginRiskyKeywords.message
source: Plugin content or config includes shell, permission, deletion, network-download, or secret-related keywords. Review manually.
zh_hans: 插件内容或配置中出现 shell、权限、删除、网络下载或密钥相关关键词。建议人工审查。

# risk.pluginRiskyKeywords.title
source: Plugin contains high-risk instruction keywords
zh_hans: 插件含高风险指令关键词

# risk.severity.high
source: High
zh_hans: 高

# risk.severity.info
source: Info
zh_hans: 提示

# risk.severity.low
source: Low
zh_hans: 低

# risk.severity.medium
source: Medium
zh_hans: 中

# risk.skillRiskyKeywords.message
source: The Skill document contains shell execution, permission, deletion, or network-download related keywords. Open the file and review manually.
zh_hans: Skill 文档中出现 shell 执行、权限、删除或网络下载相关关键词。建议打开文件人工审查。

# risk.skillRiskyKeywords.title
source: Skill document contains high-risk instruction keywords
zh_hans: Skill 文档含高风险指令关键词

# risks.empty.message
source: No obvious risk found by current static rules. Still manually review third-party MCP servers and Skills.
zh_hans: 当前静态规则没有发现明显风险。建议仍然人工审查第三方 MCP 和 Skills。

# risks.empty.title
source: No Risk Warnings
zh_hans: 没有风险提示

# risks.related
source: Related item: %@
zh_hans: 关联项：%@

# risks.section.subtitle
source: %d items. These are static heuristic checks, not a complete security audit.
zh_hans: 共 %d 条。这里是静态启发式检查，不等同于完整安全审计。

# scope.discovered
source: Discovered
zh_hans: 扫描发现

# scope.project
source: Project
zh_hans: 项目级

# scope.system
source: System
zh_hans: 系统级

# scope.user
source: User
zh_hans: 用户级

# sidebar.backups
source: Backups & Diff
zh_hans: 备份与 Diff

# sidebar.configs
source: Config Files
zh_hans: 配置文件

# sidebar.dashboard
source: Dashboard
zh_hans: 总览

# sidebar.migration
source: Migration
zh_hans: 迁移

# sidebar.risks
source: Risks
zh_hans: 风险

# skills.empty.message
source: Scans ~/.claude/skills, ~/.openclaw/skills, ~/.agents/skills, and workspace Skills directories.
zh_hans: 会扫描 ~/.claude/skills、~/.openclaw/skills、~/.agents/skills 以及项目内 Skills 目录。

# skills.empty.title
source: No Skills Found
zh_hans: 没有发现 Skills

# skills.section.subtitle
source: %d total. Identified by SKILL.md.
zh_hans: 共 %d 个。以 SKILL.md 为识别依据。

# summary.configDeclaredPlugin
source: Plugin declared in config file
zh_hans: 配置文件中声明的插件

# summary.configFound
source: Config file found
zh_hans: 已发现配置文件

# summary.configFoundWithSize
source: Config file found, size %@
zh_hans: 已发现配置文件，大小 %@

# summary.configMissing
source: Config file not found
zh_hans: 未发现配置文件

# summary.disabledEnabledField
source: Disabled by disabled/enabled field
zh_hans: disabled / enabled 字段标记为停用

# summary.localPluginFile
source: Local plugin file
zh_hans: 本地插件文件

# summary.notExtracted
source: No summary extracted
zh_hans: 未提取到说明

# summary.unnamedPlugin
source: Unnamed plugin
zh_hans: 未命名插件

# toolbar.searchPlaceholder
source: Search name, path, command
zh_hans: 搜索名称、路径、命令

# toolbar.subtitle.default
source: Last scan: %@ · User/system config · Auto-backup before edits
zh_hans: 最后扫描：%@ · 用户级/系统级配置 · 编辑前自动备份

# toolbar.subtitle.workspace
source: Last scan: %@ · Workspace: %@
zh_hans: 最后扫描：%@ · 项目：%@

# toolbar.title
source: Local AI Plugins & MCP Manager
zh_hans: AI 插件与 MCP 本地管理
